In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randint(0, 50, (3,4)))
df
# df.apply()

    0   1   2   3
0  47  19  13  16
1   2  16  34  38
2  35  18  41  49

In [3]:
df.index = list('ABC')

In [4]:
df.columns = list('abcd')

In [13]:
df

    a   b   c   d
A  47  19  13  16
B   2  16  34  38
C  35  18  41  49

In [28]:
def func(x):
    return x
df.apply(func)

    a   b   c   d
A  47  19  13  16
B   2  16  34  38
C  35  18  41  49

In [27]:
df.apply(lambda x : x.max()-x.min())

      a    b     c     d
A  2209  361   169   256
B     4  256  1156  1444
C  1225  324  1681  2401

In [ ]:
df.apply(lambda x : x**2)

In [30]:
def funs(s):
    return s + 10

In [31]:
df.applymap(funs)

    a   b   c   d
A  57  29  23  26
B  12  26  44  48
C  45  28  51  59

In [36]:
df.applymap(lambda x : x+2)

    a   b   c   d
A  49  21  15  18
B   4  18  36  40
C  37  20  43  51

In [37]:
df['a'].apply(lambda x : x+2)

A    49
B     4
C    37
Name: a, dtype: int64

In [39]:
ser1 = pd.Series(np.random.randint(-10,10,5), index=[5,2,4,3,1])
df = pd.DataFrame(np.random.randint(-10,10,(4,5)), index=[3,2,4,1,], columns=list('abcde'))

In [40]:
ser1.sort_index()

1    1
2   -7
3    6
4    9
5    5
dtype: int32

In [42]:
ser1.sort_index(ascending=False)

5    5
4    9
3    6
2   -7
1    1
dtype: int32

In [44]:
ser1.sort_values()

2   -7
1    1
5    5
3    6
4    9
dtype: int32

In [45]:
ser1.sort_values(ascending=False)

4    9
3    6
5    5
1    1
2   -7
dtype: int32

In [46]:
df

   a  b   c  d  e
3 -7  0 -10 -4 -5
2  1 -3  -9  5 -6
4 -8 -7  -4  6  8
1 -6  0  -6  6  7

In [47]:
df.sort_index()

   a  b   c  d  e
1 -6  0  -6  6  7
2  1 -3  -9  5 -6
3 -7  0 -10 -4 -5
4 -8 -7  -4  6  8

In [48]:
df.sort_index(ascending=False)

   a  b   c  d  e
4 -8 -7  -4  6  8
3 -7  0 -10 -4 -5
2  1 -3  -9  5 -6
1 -6  0  -6  6  7

In [57]:
# 按某一列
df.sort_values(by='a',axis=0)

   a  b   c  d  e
4 -8 -7  -4  6  8
3 -7  0 -10 -4 -5
1 -6  0  -6  6  7
2  1 -3  -9  5 -6

In [58]:
# 按某一行
df.sort_values(by=3,axis=1)

    c  a  e  d  b
3 -10 -7 -5 -4  0
2  -9  1 -6  5 -3
4  -4 -8  8  6 -7
1  -6 -6  7  6  0

In [63]:
f = open('RFM_TRAD_FLOW.csv')
data = pd.read_csv(f)

In [64]:
d = data[:10]

In [65]:
d

   transID  cumid              time  amount type_label            type
0     9407  10001  14JUN09:17:58:34   199.0         正常          Normal
1     9625  10001  16JUN09:15:09:13   369.0         正常          Normal
2    11837  10001  01JUL09:14:50:36   369.0         正常          Normal
3    26629  10001  14DEC09:18:05:32   359.0         正常          Normal
4    30850  10001  12APR10:13:02:20   399.0         正常          Normal
5    32007  10001  04MAY10:16:45:58   269.0         正常          Normal
6    36637  10001  04JUN10:20:03:06     0.0         赠送       Presented
7    43108  10001  06JUL10:16:56:40   381.0         正常          Normal
8    43877  10001  10JUL10:20:41:54  -399.0         退货  returned_goods
9    46081  10001  23JUL10:16:35:45     0.0         赠送       Presented

In [66]:
d.sort_values(by='amount')

   transID  cumid              time  amount type_label            type
8    43877  10001  10JUL10:20:41:54  -399.0         退货  returned_goods
6    36637  10001  04JUN10:20:03:06     0.0         赠送       Presented
9    46081  10001  23JUL10:16:35:45     0.0         赠送       Presented
0     9407  10001  14JUN09:17:58:34   199.0         正常          Normal
5    32007  10001  04MAY10:16:45:58   269.0         正常          Normal
3    26629  10001  14DEC09:18:05:32   359.0         正常          Normal
1     9625  10001  16JUN09:15:09:13   369.0         正常          Normal
2    11837  10001  01JUL09:14:50:36   369.0         正常          Normal
7    43108  10001  06JUL10:16:56:40   381.0         正常          Normal
4    30850  10001  12APR10:13:02:20   399.0         正常          Normal

In [67]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
transID       10 non-null int64
cumid         10 non-null int64
time          10 non-null object
amount        10 non-null float64
type_label    10 non-null object
type          10 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 560.0+ bytes

In [68]:
d.describe()

            transID    cumid      amount
count     10.000000     10.0   10.000000
mean   29005.800000  10001.0  194.600000
std    14307.635178      0.0  257.776044
min     9407.000000  10001.0 -399.000000
25%    15535.000000  10001.0   49.750000
50%    31428.500000  10001.0  314.000000
75%    41490.250000  10001.0  369.000000
max    46081.000000  10001.0  399.000000

In [69]:
d

   transID  cumid              time  amount type_label            type
0     9407  10001  14JUN09:17:58:34   199.0         正常          Normal
1     9625  10001  16JUN09:15:09:13   369.0         正常          Normal
2    11837  10001  01JUL09:14:50:36   369.0         正常          Normal
3    26629  10001  14DEC09:18:05:32   359.0         正常          Normal
4    30850  10001  12APR10:13:02:20   399.0         正常          Normal
5    32007  10001  04MAY10:16:45:58   269.0         正常          Normal
6    36637  10001  04JUN10:20:03:06     0.0         赠送       Presented
7    43108  10001  06JUL10:16:56:40   381.0         正常          Normal
8    43877  10001  10JUL10:20:41:54  -399.0         退货  returned_goods
9    46081  10001  23JUL10:16:35:45     0.0         赠送       Presented

In [70]:
f.close()

In [81]:
s = pd.Series(np.random.randint(-10,10,10), pd.MultiIndex.from_product([['one', 'two'], ['a', 'b']]))
# df = pd.DataFrame(np.random.randint(-10,10,(4,5)), index=[3,2,4,1,], columns=list('abcde'))

In [82]:
s

a  q    1
   w   -7
b  e    4
   r   -8
c  t   -4
   y   -5
d  u    1
   i    9
e  o   -1
   p   -5
dtype: int32

In [99]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd', 'e'], ['e', 'i', 'o', 'p', 'q', 'r', 't', 'u', 'w', 'y']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3, 4, 4], [4, 8, 0, 5, 6, 9, 7, 1, 2, 3]])

In [98]:
s['a']

q    1
w   -7
dtype: int32

In [87]:
s['a', 'q']

1

In [105]:
s.swaplevel()

q  a    1
w  a   -7
e  b    4
r  b   -8
t  c   -4
y  c   -5
u  d    1
i  d    9
o  e   -1
p  e   -5
dtype: int32

In [109]:
s = pd.Series(np.random.randint(-10,10,10), pd.MultiIndex.from_product([['A', 'B','C','D','E'], ['a', 'b']]))

In [110]:
s

A  a    2
   b    7
B  a    4
   b   -4
C  a   -1
   b   -6
D  a    9
   b    1
E  a    5
   b   -3
dtype: int32

In [111]:
s.unstack(level=0)

   A  B  C  D  E
a  2  4 -1  9  5
b  7 -4 -6  1 -3

In [127]:
s.unstack(level=1)

   a  b
A  2  7
B  4 -4
C -1 -6
D  9  1
E  5 -3

In [124]:
d = s.unstack(level=1)

In [125]:
d

   a  b
A  2  7
B  4 -4
C -1 -6
D  9  1
E  5 -3

In [126]:
d.stack()

A  a    2
   b    7
B  a    4
   b   -4
C  a   -1
   b   -6
D  a    9
   b    1
E  a    5
   b   -3
dtype: int32

In [128]:
d

   a  b
A  2  7
B  4 -4
C -1 -6
D  9  1
E  5 -3

In [129]:
d.to_dict()

{'a': {'A': 2, 'B': 4, 'C': -1, 'D': 9, 'E': 5},
 'b': {'A': 7, 'B': -4, 'C': -6, 'D': 1, 'E': -3}}

In [130]:
df = pd.DataFrame(np.random.randint(-10,10,(4,5)), index=list('ABCD'), columns=list('abcde'))

In [131]:
df

   a  b  c   d  e
A -1 -5  3  -9  7
B -7 -3  2  -4  0
C -6 -1  3   8 -6
D  1  4 -1 -10  3

In [132]:
df.sum()

a   -13
b    -5
c     7
d   -15
e     4
dtype: int64

In [133]:
df.sum(axis=1)

A    -5
B   -12
C    -2
D    -3
dtype: int64

In [134]:
df.mean()

a   -3.25
b   -1.25
c    1.75
d   -3.75
e    1.00
dtype: float64

In [135]:
df.mean(axis=1)

A   -1.0
B   -2.4
C   -0.4
D   -0.6
dtype: float64

In [141]:
s = pd.Series({
    'a':1,
    'b':8,
    'c':8,
    'd':np.nan,
    'e':4
})
s.name = 'E'
dd = df.append(s)

In [142]:
dd

     a    b    c     d    e
A -1.0 -5.0  3.0  -9.0  7.0
B -7.0 -3.0  2.0  -4.0  0.0
C -6.0 -1.0  3.0   8.0 -6.0
D  1.0  4.0 -1.0 -10.0  3.0
E  1.0  8.0  8.0   NaN  4.0

In [144]:
dd.mean(skipna=False)

a   -2.4
b    0.6
c    3.0
d    NaN
e    1.6
dtype: float64

In [145]:
df

   a  b  c   d  e
A -1 -5  3  -9  7
B -7 -3  2  -4  0
C -6 -1  3   8 -6
D  1  4 -1 -10  3

In [146]:
df.describe()

             a        b         c          d         e
count  4.00000  4.00000  4.000000   4.000000  4.000000
mean  -3.25000 -1.25000  1.750000  -3.750000  1.000000
std    3.86221  3.86221  1.892969   8.261356  5.477226
min   -7.00000 -5.00000 -1.000000 -10.000000 -6.000000
25%   -6.25000 -3.50000  1.250000  -9.250000 -1.500000
50%   -3.50000 -2.00000  2.500000  -6.500000  1.500000
75%   -0.50000  0.25000  3.000000  -1.000000  4.000000
max    1.00000  4.00000  3.000000   8.000000  7.000000

In [147]:
df['a']

A   -1
B   -7
C   -6
D    1
Name: a, dtype: int32

In [148]:
dd

     a    b    c     d    e
A -1.0 -5.0  3.0  -9.0  7.0
B -7.0 -3.0  2.0  -4.0  0.0
C -6.0 -1.0  3.0   8.0 -6.0
D  1.0  4.0 -1.0 -10.0  3.0
E  1.0  8.0  8.0   NaN  4.0

In [149]:
dd.describe()

              a         b        c          d         e
count  5.000000  5.000000  5.00000   4.000000  5.000000
mean  -2.400000  0.600000  3.00000  -3.750000  1.600000
std    3.847077  5.319774  3.24037   8.261356  4.929503
min   -7.000000 -5.000000 -1.00000 -10.000000 -6.000000
25%   -6.000000 -3.000000  2.00000  -9.250000  0.000000
50%   -1.000000 -1.000000  3.00000  -6.500000  3.000000
75%    1.000000  4.000000  3.00000  -1.000000  4.000000
max    1.000000  8.000000  8.00000   8.000000  7.000000

In [14]:
d1 = pd.DataFrame({
    'key1':list('abcde'),
    'data1':np.random.randint(0, 50, 5)
})
d2 = pd.DataFrame({
    'key2':list('abcdefgh'),
    'data2':np.random.randint(0, 50, 8)
})

In [15]:
d1

  key1  data1
0    a      2
1    b     12
2    c     23
3    d     40
4    e      8

In [16]:
d2

  key2  data2
0    a     36
1    b     15
2    c     30
3    d     29
4    e     47
5    f     16
6    g     25
7    h     45

In [17]:
pd.merge(d1,d2, on='key')

KeyError: 'key'

In [13]:
pd.merge(d1,d2)

  key  data1  data2
0   a     28     28
1   b     17     10
2   c      8     49
3   d     43     44
4   e     30     40

In [18]:
d1

  key1  data1
0    a      2
1    b     12
2    c     23
3    d     40
4    e      8

In [19]:
d2

  key2  data2
0    a     36
1    b     15
2    c     30
3    d     29
4    e     47
5    f     16
6    g     25
7    h     45

In [24]:
pd.merge(d1,d2, how='inner', left_on='key1', right_on='key2')

  key1  data1 key2  data2
0    a      2    a     36
1    b     12    b     15
2    c     23    c     30
3    d     40    d     29
4    e      8    e     47

In [25]:
pd.merge(d1,d2, how='outer', left_on='key1', right_on='key2')

  key1  data1 key2  data2
0    a    2.0    a     36
1    b   12.0    b     15
2    c   23.0    c     30
3    d   40.0    d     29
4    e    8.0    e     47
5  NaN    NaN    f     16
6  NaN    NaN    g     25
7  NaN    NaN    h     45

In [26]:
pd.merge(d1,d2, how='left', left_on='key1', right_on='key2')

  key1  data1 key2  data2
0    a      2    a     36
1    b     12    b     15
2    c     23    c     30
3    d     40    d     29
4    e      8    e     47